read_liberty -lib stdcells.lib

read_verilog -sv mulAddRecFN.v Berk_MAC_wrapper.v HardFloat_primitives.v HardFloat_rawFN.v isSigNaNRecFN.v

hierarchy -check -top Berk_MAC_wrapper

synth -top Berk_MAC_wrapper

# Map flip-flops
dfflibmap -liberty stdcells.lib

abc -liberty stdcells.lib

# Reports
stat -liberty stdcells.lib

# Timing report
write_verilog -noattr Berk_MAC_wrapper_mapped.v
